projects/app/Http/Controllers/PageController.php

insert into `contactus_requests` (`service`, `name`, `mobile`, `email`, `city`, `message`, `updated_at`, `created_at`) values ('8', 'Tucker Becker', '+1 (533) 367-9582', 'jibuxi@mailinator.com', 'Sint quo officiis n', 'Aut dolor voluptatib', '2026-07-12 09:15:49', '2026-07-12 09:15:49')
---
    function contactPost(Request $request)
    {

        $validator = Validator::make($request->all(), [
            'name' => "required",
            'email' => 'required|email',
            'mobile' => 'required',
            'service' => 'required',
            "message" => "required|min:10"
        ]);
        if ($validator->fails()) {
            return redirect()->back()->withInput()->with("danger", $validator->errors()->first())->withErrors($validator->errors());
        }

        $request['created_at'] = date("y-m-d H:i:s");

        ContactusRequest::create($request->all());

select * from `faqs` where `faqs`.`type` in (1, 3, 5, 6, 7, 8, 9, 10)
select `name`, `id` from `services` where `publish` = 'published' and exists (select * from `faqs` where `services`.`id` = `faqs`.`type`)
---
    public function index(Request $request)
    {


        $data = Cms::where("seo_url", 'home')->first();
        $policydata = Service::with(['faqs'])->where('publish', 'published')->whereHas('faqs')->get(['name','id']);

select * from `blog_categories` where `seo_url` = 'retirement-plans' limit 1
---
            return view($templete, compact("data"));
        }

        $data = BlogCategory::where("seo_url", $seo_url)->first();

select * from `faqs` where `faqs`.`type` in (8)
select * from `services` where `seo_url` = 'retirement-plans' limit 1
---
        $data = Cms::where("seo_url", 'policy-detail')->first();

        if ($data) {
            $insurance = Service::with('faqs')->where("seo_url", $seo_url)->first();