projects/app/Helper/ModelHelper.php

	public function getDataFromSetting($name){
		$result=null;
		$data=BasicSetting::where("name",$name)->first();
---
select * from `basic_settings` where `name` = 'favicon' limit 1